// Задача №1: Выдаем максимальные значения из двух чисел
int a = -9;
int b = -3;
int max = 0;
Console.WriteLine("значение a= " +a);
Console.WriteLine("значение b= " +b);

if(a<b)
{
    max = b;
}

{
    max = a;
}

Console.Write("Maксимальное значение: ");
Console.WriteLine(max);