/* 
Задача 58: 
Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
Например, даны 2 матрицы:
2 4 | 3 4
3 2 | 3 3
Результирующая матрица будет:
18 20
15 18

- задать матрицу a
- задать матрицу b
- сравнить матрицы на возможность перемножения, длина строки 1 = длине столбца 2
- заполнение матрицы c:
*/

int[,] a = new int[,]
{
    {1,2},
    {3,4},
    {5,6}
};
int[,] b = new int[,]
{
    {1,2,3},
    {4,5,6}
};

int[,] c = new int[a.GetLength(0), b.GetLength(1)];


//   I J  =  a[i,k] *   b [k,j]
//   I J  =  a[i,k] *   b [k,j]
// c 0,0  =  a 0,0   *   b 0,0+         c 0,1  =  a 0,0   *   b 0,1+        c 0,2  =  a 0,0   *   b 0,2+
//           a 0,1   *   b 1,0                    a 0,1   *   b 1,1                   a 0,1   *   b 1,2

// c 1,0  =  a 1,0   *   b 0,0+         c 1,1  =  a 1,0   *   b 0,1+        c 1,2  =  a 1,0   *   b 0,2+
//           a 1,1   *   b 1,0                    a 1,1   *   b 1,1                   a 1,1   *   b 1,2

// c 2,0  =  a 2,0   *   b 0,0+         c 2,1  =  a 2,0   *   b 0,1+        c 2,2  =  a 2,0   *   b 0,2+
//           a 2,1   *   b 1,0                    a 2,1   *   b 1,1                   a 2,1   *   b 1,2

for (int j = 0; j < a.GetLength(0); j++)
{
    for (int i = 0; i < b.GetLength(1); i++)
    {
        c[i, j] = 0;
        for (int k = 0; k < a.GetLength(1); k++)
        {
            c[i, j] = c[i, j] + a[i, k] * b[k, j];

        }

    }

}

